tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"

brew "openssl@1.1"
brew "openssl@3"
brew "wget"
brew "tree"
brew "bat"
brew "fd"
brew "jq"
brew "httpie"
brew "p7zip"
brew "ncdu"
brew "git"
brew "git-lfs"
brew "ssh-copy-id"
brew "starship"
brew "awscli"
brew "direnv"
brew "gh"
brew "eza"          # like ls but easier to configure
brew "cloc"         # count line-of-code
brew "tokei"        # count line-of-code
brew "mas"          # Mac AppStore cli for automation

# https://github.com/zsh-users/zsh-syntax-highlighting/blob/master/INSTALL.md
brew "zsh-syntax-highlighting"

# https://github.com/zsh-users/zsh-autosuggestions/blob/master/INSTALL.md
brew "zsh-autosuggestions"

# Setup step needed for all of this. 
# Refer to their github repo for info.
brew "fzf"          # fuzzy find. I use it mainly for history search
brew "fnm"          # fast node version switcher
brew "git-delta"    # file diff in a terminal
brew "difftastic"   # file diff in a terminal based on AST instead of word diffing
brew "broot"        # visual folder navigation in a tree-like UI
brew "zoxide"       # auto cd into folders by partial match 
brew "atuin"        # shell history (alternative to fzf)

# Development tool casks
cask "iterm2"
cask "sublime-text"
cask "sublime-merge"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "docker"
cask "postman"
cask "dotnet-sdk"
cask "ngrok"

# databases
brew "mongodb-database-tools" 
cask "mongodb-compass"
cask "dbeaver-community"

# Browsers
cask "google-chrome"
cask "firefox"
cask "tor-browser"

# Miscs
# cask "raycast"    # already installed
cask "roam-research"
cask "obsidian"
cask "slack"
cask "notion"
cask "notion-calendar"
cask "miro"
cask "dropbox"
cask "google-drive"
cask "vlc"
cask "zoom"
cask "pop"
cask "microsoft-teams"
cask "stay"         # Useful in a multi-monitor setting. You can save and load window placement. 
                    # It's vital when the monitors are slow to wake up and macOS doesn't do right thing (paid software)

# Fonts
cask "font-bebas-neue"
cask "font-fira-code"
cask "font-jetbrains-mono"


# AppStore apps
# mas "Bitwarden", id:1352778147 #already installed through AppStore